<template>
  <page-header
    class="pt-3"
    title="توافق نامه"
    subtitle="لطفا متن توافق نامه را مطالعه کرده و امضا کنید."
    :show-back="true"
    :has-support="false"
  />
  <p class="ap-page-wrapper ap-txt-body-2 ap-text-primary agreement">
    متن توافق نامه به صورت تستی نوشته شده لطفا متن اصلی را این قسمت قرار دهیدمتن توافق نامه به صورت
    تستی نوشته شده لطفا متن اصلی را این قسمت قرار دهیدمتن توافق نامه به صورت تستی نوشته شده لطفا متن
    اصلی را این قسمت قرار دهیدمتن توافق نامه به صورت تستی نوشته شده لطفا متن اصلی را این قسمت قرار
    دهیدمتن توافق نامه به صورت تستی نوشته شده لطفا متن اصلی را این قسمت قرار دهیدمتن توافق نامه به
    صورت تستی نوشته شده لطفا متن اصلی را این قسمت قرار دهیدمتن توافق نامه به صورت تستی نوشته شده
    لطفا متن اصلی را این قسمت قرار دهید
  </p>
  <fixed-action-btn title="تایید" />
</template>

<script lang="ts" setup></script>

<style scoped>
  .agreement {
    line-height: 28px;
  }
</style>
